app/controllers/school_classes_controller.rb

INSERT INTO "school_classes" ("room_number", "title", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["room_number", 5], ["title", "Computer Science"], ["created_at", "2019-02-04 15:02:22.316653"], ["updated_at", "2019-02-04 15:02:22.316653"]]
---
    def create
        @school_class=SchoolClass.create(params.require(:school_class).permit(:title, :room_number))

SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT 1  [["id", 2]]
UPDATE "school_classes" SET "room_number" = ?, "title" = ?, "updated_at" = ? WHERE "school_classes"."id" = ?  [["room_number", 10], ["title", "Risk Analysis"], ["updated_at", "2019-02-04 15:03:41.644359"], ["id", 1]]
---
    def update
        @school_class=SchoolClass.find(params[:id])
        @school_class.update(params.require(:school_class).permit(:title, :room_number))