app/controllers/students_controller.rb

SELECT  "students".* FROM "students"  ORDER BY "students"."id" DESC LIMIT 1
---
    def index
        @students=Student.all

INSERT INTO "students" ("last_name", "first_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["last_name", "asdsd"], ["first_name", "we"], ["created_at", "2019-02-04 03:04:09.395115"], ["updated_at", "2019-02-04 03:04:09.395115"]]
---
    def create
        @student=Student.create(params.require(:student).permit(:first_name, :last_name))